rest-server/src/soap/client/CAPSoapHttp.getRequest.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns3="http://gov.fema.ipaws.services/caprequest"
    xmlns:ns4="http://gov.fema.ipaws.services/capresponse"
    xmlns:ns5="urn:oasis:names:tc:emergency:cap:1.2"
    xmlns:ns2="http://gov.fema.ipaws.services/IPAWS_CAPService/">
 <SOAP-ENV:Header>
  <ns2:CAPHeaderTypeDef SOAP-ENV:mustUnderstand="1">
   <ns2:logonUser></ns2:logonUser>
   <ns2:logonCogId>0</ns2:logonCogId>
  </ns2:CAPHeaderTypeDef>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns2:getRequestTypeDef>
    <ns3:requestAPI></ns3:requestAPI>
    <ns3:requestOperation></ns3:requestOperation>
    <ns3:parameters>
     <ns3:parameterName></ns3:parameterName>
     <ns3:comparisonOp></ns3:comparisonOp>
     <ns3:parameterValue></ns3:parameterValue>
     <ns3:logicalOp></ns3:logicalOp>
    </ns3:parameters>
   </ns2:getRequestTypeDef>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
